<img src="https://ga-dash.s3.amazonaws.com/production/assets/logo-9f88ae6c9c3871690e33280fcf557f33.png" style="float: left; margin: 10px">

# SQL JOINS

Week 5 | Lesson 4.1

## A Short Recap

* We spoke about the basic SELECT syntax
* We spoke about set operations
* We spoke about Group by, having and aggregate functions

## Northwind Database
![](./assets/images/Northwind_A4_size_for_Print.png)

** LEFT JOIN / RIGHT JOIN**

SQL Syntax:

```sql
SELECT a.col1, a.col2, b.col3 FROM a LEFT JOIN/RIGHT JOIN b ON a.col1 = b.col1
```

Take the set a as is, join every element in b with the corresponding col. If there is an element in set a that has no match in b then return NULL for the b columns. Same idea for RIGHT JOIN just the reversed way.

**Example**
```sql
SELECT products."ProductID",products."ProductName" ,order_details."Discount" 
FROM products LEFT JOIN order_details ON products."ProductID" = order_details."ProductID"
WHERE order_details."Discount" > 0;
```

**Question:** What is the result of this SELECT statement?

**Example**

Let's create a new table in mydb.

```sql
CREATE TABLE newtable(
    key varchar(2),
    value INT);
    
CREATE TABLE newtable2(
    key varchar(2),
    value INT);
```


And insert some values:

```sql
INSERT INTO newtable VALUES ('a1', 2);
INSERT INTO newtable VALUES ('a2', 1);
INSERT INTO newtable VALUES ('a3', 4);
INSERT INTO newtable2 VALUES ('a1', 1);
INSERT INTO newtable2 VALUES ('b2', 1);
INSERT INTO newtable2 VALUES ('a3', 4);
```


**Queastion**: Explain the result of
```sql
SELECT * from newtable LEFT JOIN newtable2 on newtable.key = newtable2.key;
```
and
```sql
SELECT * from newtable RIGHT JOIN newtable2 on newtable.key = newtable2.key;
```

**Independent Practice (30 min):**

Analyse the following SQL Query. Go from the inside out. What is the result?

```sql
SELECT employees."FirstName", employees."LastName", b."RegionDescription" FROM
(SELECT employeeterritories."EmployeeID", a."RegionDescription" FROM
(SELECT territories."TerritoryID" , region."RegionDescription"
FROM territories LEFT JOIN region ON territories."RegionID" = region."RegionID") AS a 
LEFT JOIN employeeterritories ON employeeterritories."TerritoryID" = a."TerritoryID") AS b
LEFT JOIN employees ON employees."EmployeeID" = b."EmployeeID" 
WHERE employees."FirstName" IS NOT NULL;
```

What do I need to change so that the result is the shows the region for each employee?

**INNER JOIN**

SQL Syntax:

```sql
SELECT a.col1, a.col2, b.col3 FROM a INNER JOIN b ON a.col1 = b.col1
```

Joins two sets on specific columns if the column value exists in boths sets.

**Practice (30min)**

1. Use RIGHT JOIN, INNER JOIN, LEFT JOIN on the two tables newtable and newtable2. Describe to your neighbors how the joins differ from each other.
2. Find the total revenue for each employee. Use ORDER BY or HAVING to find the employee with the highest and lowest revenue.

**What did we learn today?**

* We learned how to insert values into a table.
* We learned about the three different types of JOINS namely LEFT, RIGHT and INNER.
* We learned how to analyse SQL Code follow the tracks